#Напишите прогрумму, которая получает строку и выводит все ее символы в столбик

variable = input()
for i in variable:
    print(i)