#Создать переменные:
#‘Today is Monday’
#‘Tomorrow is Friday’
#Программа меняет дни
#местами.


first_variable = 'Today is Monday'
second_variable = 'Tomorrow is Friday'

print(first_variable.replace('Monday', 'Friday'))
print(second_variable.replace('Friday', 'Monday'))

