#Создать переменную ‘I love
#programming’. Программа
#должнавыводить ‘program’

word = 'I love programming'

print(word[7:14])

