#Создать переменные ‘I love
#programming’ и ‘python’.
#Программа должна выводить
#‘I love python’

first_variable = 'I love programming'
second_variable = 'python'

print(first_variable[:7] + second_variable)