#Дана строка 'rythm rough rush shake than’. Программа удаляет все буквы «а» в строке и
#полсчитывает кол-во уждаленных символов

variable = 'rythm rough rush shake than'

print(variable.count('a'), '\n', (variable.replace('a', '')))
