#Дана строка 'rythm rough rush shake than’. Программа считает сколько букв ‘t’ в строке.

variable = 'rythm (rough rush shake) than'

print(variable.count('t'))
