#Создать 2 списка чисел до 100:
#1. Делятся на 10
#2. Делятся на 3

first_list = list(range(0, 100, 10))
print(first_list)
second_list = list(range(3, 100, 3))
print(second_list)