#Создать 2 списка:
#1. [30, 28, 26, 24, 22, 20, 18, 16, 14]
#2. Из первого списка сделать
#список [14, 16, 18]

first_list = [30, 28, 26, 24, 22, 20, 18, 16, 14]
first_list.sort()

print(first_list[0:3])
