#Пользователь вводит слово. Создайте множество из уникальных букв этого слова и выведите его.

user = input()

letters = set(user)
print(letters)