#Создайте словарь person, в котором будут ключи name, age, city. Выведите значение возраста

person = { 'name': 'Lera',
           'age': 18,
           'city': 'New York'
}
print(person['age'])